In [1]:
import pandas as pd

In [2]:
data={"Name":["Malin","Anuraj","Anagha"],"Age":[27,27,21],"Salary":[20000,25000,30000]};data

{'Name': ['Malin', 'Anuraj', 'Anagha'],
 'Age': [27, 27, 21],
 'Salary': [20000, 25000, 30000]}

In [4]:
d=pd.DataFrame(data);d                                        # To create a DataFrame

     Name  Age  Salary
0   Malin   27   20000
1  Anuraj   27   25000
2  Anagha   21   30000

# To_Csv

In [6]:
d.to_csv("output.csv",index=False)                            # To convert the DataFrame to a csv file %

In [9]:
import os                     
e=os.getcwd();e                                               # To get the Path

'C:\\Users\\malin\\Python Libraries\\Pandas'

In [10]:
a=pd.read_csv(r"C:\\Users\\malin\\Python Libraries\\Pandas\\output.csv");a          # To read the converted csv

     Name  Age  Salary
0   Malin   27   20000
1  Anuraj   27   25000
2  Anagha   21   30000

In [11]:
a.describe()                                                             # To get a describtion of mean,count..from the csv

             Age   Salary
count   3.000000      3.0
mean   25.000000  25000.0
std     3.464102   5000.0
min    21.000000  20000.0
25%    24.000000  22500.0
50%    27.000000  25000.0
75%    27.000000  27500.0
max    27.000000  30000.0

# To_Excel

In [12]:
d.to_excel("output.xlsx",index=False)                                                  # To change a DataFrame to Excel FIle

In [13]:
z=pd.read_excel(r"C:\\Users\\malin\\Python Libraries\\Pandas\\output.xlsx");z          # To read the converted Excel file

     Name  Age  Salary
0   Malin   27   20000
1  Anuraj   27   25000
2  Anagha   21   30000

# Series_DataStructure

In [ ]:
# Datastructure of pandas - DatatFrame
# Types of Data Structure
        # .DataFrame   -2D and above(Multi Dimensional)
        # .Series      -1D only

In [17]:
x=[1,2,3,4,5]
y=pd.Series(x);y                                                   # 1D ,so

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [18]:
import numpy as np

In [23]:
array=np.array([6,7,8,9,10])
b=pd.Series(array);b

0     6
1     7
2     8
3     9
4    10
dtype: int32

In [26]:
dt={"Name":"Rejoice","Place":"Thrissur","Age":25,"Salary":25000}
bt=pd.Series(dt);bt

Name       Rejoice
Place     Thrissur
Age             25
Salary       25000
dtype: object

In [30]:
bt.values

array(['Rejoice', 'Thrissur', 25, 25000], dtype=object)

In [31]:
bt.index

Index(['Name', 'Place', 'Age', 'Salary'], dtype='object')

In [32]:
bt.dtype

dtype('O')

In [35]:
b[0]

6

In [36]:
bt[0]

'Rejoice'

In [42]:
maxy=y.max();maxy                        # MAx value in a Series list

5

In [45]:
miny=y.min();miny                        # Min value in a Series list

1

In [41]:
sumy=y.sum();sumy                        #  Sum of Series list

15

In [43]:
meany=y.mean();meany                     # Mean of Series list

3.0

In [44]:
stdy=y.std();stdy                        # Standard deviation of Series list

1.5811388300841898